Memory Management Simulator
Type 'help' for commands

memsim> Switched to Virtual Memory mode
memsim> Virtual memory initialized: 64 pages, 256 bytes per page, 8 frames
memsim> Page replacement policy set to: FIFO
memsim> Page fault: loading page 0 into frame 0
Virtual address 0x0 -> Physical address 0x0
memsim> Page fault: loading page 1 into frame 1
Virtual address 0x100 -> Physical address 0x100
memsim> Page fault: loading page 2 into frame 2
Virtual address 0x200 -> Physical address 0x200
memsim> Page fault: loading page 3 into frame 3
Virtual address 0x300 -> Physical address 0x300
memsim> Page fault: loading page 4 into frame 4
Virtual address 0x400 -> Physical address 0x400
memsim> Page fault: loading page 5 into frame 5
Virtual address 0x500 -> Physical address 0x500
memsim> Page fault: loading page 6 into frame 6
Virtual address 0x600 -> Physical address 0x600
memsim> Page fault: loading page 7 into frame 7
Virtual address 0x700 -> Physical address 0x700
memsim> Page fault: evicting page 0 from frame 0
Page fault: loading page 8 into frame 0
Virtual address 0x800 -> Physical address 0x0
memsim> Page fault: evicting page 1 from frame 1
Page fault: loading page 0 into frame 1
Virtual address 0x0 -> Physical address 0x100
memsim> Page fault: evicting page 2 from frame 2
Page fault: loading page 1 into frame 2
Virtual address 0x100 -> Physical address 0x200
memsim> 
=== Virtual Memory Statistics ===
Total page accesses: 11
Page hits: 0
Page faults: 11
Page hit ratio: 0.00%
Page fault ratio: 100.00%
=================================

memsim> Virtual memory statistics reset
memsim> Page replacement policy set to: LRU
memsim> Page fault: loading page 16 into frame 0
Virtual address 0x1000 -> Physical address 0x0
memsim> Page fault: loading page 32 into frame 1
Virtual address 0x2000 -> Physical address 0x100
memsim> Page fault: loading page 48 into frame 2
Virtual address 0x3000 -> Physical address 0x200
memsim> Virtual address 0x1000 -> Physical address 0x0
memsim> Error: Invalid virtual address 0x4000
Error: Failed to translate virtual address 0x4000
memsim> Virtual address 0x1000 -> Physical address 0x0
memsim> 
=== Virtual Memory Statistics ===
Total page accesses: 5
Page hits: 2
Page faults: 3
Page hit ratio: 40.00%
Page fault ratio: 60.00%
=================================

memsim> Exiting simulator...
